package com.example.MJM;

import java.util.List;

public class Data {   //데이터만 관리하는 데이터 클래스

    protected List<String> list;  //강의실 번호 데이터를 넣은 리스트 변수

    public void settingList() { //검색에 사용될 데이터 리스트 추가
        list.add("Y1234"); // for testing
        list.add("Y2234");
        list.add("Y3234");
        list.add("Y4234");
        list.add("Y5234");
        list.add("Y6234");
        list.add("Y7234");
        list.add("Y8234");
        list.add("Y9234");
        list.add("Y10234"); // 9
        list.add("Y11234");
        list.add("Y12234");
        list.add("Y13234");
        list.add("Y14234");
        list.add("Y15234");
        list.add("Y1244");
        list.add("Y1254");
        list.add("Y1264"); //17th
        list.add("Y5101"); // test 2, 18th 12tude
        //리스트는 추가 가능
    }

    double[] latitude = {37.22475, 37.22146, 37.22246007484329, 37.22146, 37.22216, 37.22214, 37.22118, 37.22039, 37.21920, 37.21891,
            37.22138, 37.22379, 37.22202, 37.22397, 37.22337, 37.22396, 37.22305, 37.22210, 37.21904, 37.22113, 37.22393, 37.22511,
            37.22381, 37.22335, 37.22238, 37.21943, 37.22233, 37.22165};
    double[] longitude = {127.18768, 127.18684, 127.18715734722015, 127.18684, 127.18850, 127.19080, 127.18851, 127.18534, 127.18296, 127.18375,
            127.18926, 127.18687, 127.18758, 127.18752, 127.18716, 127.18183, 127.18688, 127.18851, 127.18250, 127.18862, 127.18186, 127.18717,
            127.18166, 127.18747, 127.18851, 127.18260, 127.18673, 127.18776};
    String[] title = {"자연캠퍼스", "제2공학관", "제1공학관", "창조예술관", "명진당", "예체능관", "함박관", "디자인조형센터", "제3공학관", "제4공학관",
            "차세대과학관", "채플관", "제5공학관", "통학버스 승강장", "학생회관", "명덕관", "학생복지관(은행)", "명진당 지하(GS25)", "3공학관(CU)", "함박관(세븐일레븐)", "명덕관(GS25)",
            "할리스커피", "명덕관 1층", "학생회관 카페", "명진당 4층", "3공학관 지하", "1공학관 1층", "5공학관 1층"};
    String[] memo = {"정문입니다", "건물번호: Y8", "건물번호: Y", "건물번호: Y2", "건물번호: Y3", "건물번호: Y6", "건물번호: Y9", "건물번호: Y12", "건물번호: Y19", "건물번호: Y13",
            "건물번호: Y23", "건물번호: Y22", "건물번호: Y5", "통학버스 승강장입니다.", "건물번호: Y1", "건물번호: Y31", "은행", "GS25", "CU", "세븐일레븐" ,"GS25", "HOLLYS", "명덕카페",
            "카페", "복사실", "복사실", "복사실", "복사실"};
}