package com.example.MJM;

import java.util.List;

public class Data {   //데이터만 관리하는 데이터 클래스

    protected List<String> list;  //강의실 번호 데이터를 넣은 리스트 변수

    public void settingList() { //검색에 사용될 데이터 리스트 추가

        list.add("Y114"); // 학회실 //제1공학관 - 1층
        list.add("Y131"); // 공과대 학생회실
        list.add("Y131-1"); // 복사실
        list.add("Y201"); // CAD 및 컴퓨터 실습실 //제1공학관 - 2층
        list.add("Y215"); // 제3통합교학팀
        list.add("Y224"); // 캡스톤디자인실(기계)
        list.add("Y314"); // 에너지환경촉매연구실 //제1공학관 - 3층
        list.add("Y321"); // 지능형시스템연구실
        list.add("Y322"); // 지능형시스템연구실
        list.add("Y401"); // 고분자재료 연구실 //제1공학관 - 4층
        list.add("Y429"); // PC실
        list.add("Y505"); // 산학컨소시엄센터 //제1공학관 - 5층
        list.add("Y509"); // 물류정보시스템연구소
        list.add("YP101"); // 학회실 //제1공학관 - 6층 //13th

        list.add("Y8101"); // 기업인재개발원강의실1 //제2공학관(에코바이오관) - 1층
        list.add("Y8201"); // 기업인재개발원강의실2 //제2공학관(에코바이오관) - 2층
        list.add("Y8205"); // 기업인재개발원강의실3
        list.add("Y8313"); // 통합교학팀 //제2공학관(에코바이오관) - 3층
        list.add("Y8316"); // 학생회실(생명)
        list.add("Y8407"); // 연구실11(생명)  //제2공학관(에코바이오관) - 4층
        list.add("Y8410"); // 연구실10(생명)
        list.add("Y8516"); // 공동기기실(생명) //제2공학관(에코바이오관) - 5층
        list.add("Y8537"); // 회의실/PC실
        list.add("Y8625"); // BK21연구센터 연구교수실험실 //제2공학관(에코바이오관) - 6층
        list.add("Y8637"); // 세미나실
        list.add("Y8701"); // 연구실9  //제2공학관(에코바이오관) - 7층
        list.add("Y8704"); // 대학원실9
        list.add("Y8819"); // 한국재단연구실  //제2공학관(에코바이오관) - 8층
        list.add("Y8839"); // E2FTC Membrane Lab1 //28th

        list.add("Y1919"); //제3공학관은 정보 없음
        list.add("Y1943"); //제3공학관은 정보 없음
        list.add("Y1927"); //제3공학관은 정보 없음
        list.add("Y1910"); //제3공학관은 정보 없음
        list.add("Y1908"); //제3공학관은 정보 없음 //33th

        list.add("Y13101"); // 학회실  //제4공학관 - 1층
        list.add("Y13102"); // PC실
        list.add("Y13115"); // 공과대학보유공간
        list.add("Y13201"); // 콘크리트연구실II   //제4공학관 - 2층
        list.add("Y13211"); // 공과대학 제 6통합 행정실
        list.add("Y13212"); // 세미나실
        list.add("Y13303"); // 연구실(구조)         //제4공학관 - 3층
        list.add("Y13317"); // 토목연구정보센터
        list.add("Y13318"); // 워크스테이션실 //42th

        list.add("Y5135"); // 디자인스튜디오A //제5공학관 - 1층
        list.add("Y5145"); // CAD/CAM실
        list.add("Y5211"); // 시청각실 //제5공학관 - 2층
        list.add("Y5243"); // 학생회실
        list.add("Y5329"); // 교통정보실   //제5공학관 - 3층
        list.add("Y5343"); // 캡스톤설계실
        list.add("Y5351"); // 공과대학 제4교학팀
        list.add("Y5401"); // PC실   //제5공학관 - 4층
        list.add("Y5425"); // 강의실(PC실 겸용)
        list.add("Y5537"); // 인증자료실  //제5공학관 - 5층
        list.add("Y5615"); // 세미나실 //제5공학관 - 6층
        list.add("Y5621"); // 실습(정보통신공)
        list.add("Y5704"); // 학생회실(컴퓨터공) //제5공학관 - 7층
        list.add("Y5748"); // 인증자료실 //56th

        list.add("Y22103"); // 소연주실  //60주년 채플관 - 1층
        list.add("Y22227"); // 성도석2
        list.add("Y22229"); // 성도석1 //60주년 채플관 - 2층
        list.add("Y22409"); // 교목실
        list.add("Y22429"); // 음향조정실 //61th

        list.add("Y12100"); // 모형제작실 //디자인조형센터 - 1층
        list.add("Y12111"); // 공간디자인 실습실A
        list.add("Y12113"); // 공간디자인 학회실
        list.add("Y12230"); // 공업디자인실습실 //디자인조형센터 - 2층
        list.add("Y12223"); // CG실
        list.add("Y12307"); // 학생회실  //디자인조형센터 - 3층
        list.add("Y12313"); // 교수실
        list.add("Y12314"); // 공간행테디자인연구실 //69th

        list.add("Y31103"); // GS25 편의점 //명덕관  //70th
        list.add("Y31104"); // 사생자치회의실
        list.add("Y31113"); // 예배실
        list.add("Y31114"); // 매점
        list.add("Y31331"); // 부사감실 //명덕관 - 3층
        list.add("Y31424"); // 관장숙직실(온돌) //명덕관 - 4층 //75th
        list.add("Y31105"); // 복사실 //76th

        list.add("Y3002"); // 학생식당 //명진당 - 지하 1층
        list.add("Y3068"); // 보존서고
        list.add("Y3108"); // 노트북열람실1 //명진당 - 1층
        list.add("Y3201"); // 자료열람실 //명진당 - 2층
        list.add("Y3235"); // 전자도서관
        list.add("Y3247"); // 영상자료실
        list.add("Y3301"); // 자료열람실 //명진당 - 3층
        list.add("Y3328"); // 보존서고
        list.add("Y3401"); // 노트북열람실2 //명진당 - 4층
        list.add("Y3406"); // 열람실
        list.add("Y3528"); // 열람실 //명진당 - 5층
        list.add("Y3601"); // 고고미술실 //명진당 - 6층 //88th

        list.add("Y3066-1"); // 매점 //명진당 - 지하 1층 //89th
        list.add("Y3456"); // 복사실 //명진당 - 4층 //90th

        list.add("Y2127"); // 뮤지컬 보컬 실습실1 //창조관 예술관 - 1층
        list.add("Y2128"); // 뮤지컬 보컬 실습실2
        list.add("Y2141"); // 강의실2(뮤지컬)
        list.add("Y2143"); // 강의실1(뮤지컬)
        list.add("Y2207"); // 교수실
        list.add("Y2437"); // 교육지원처 자연학사 지원팀
        list.add("Y2523"); // 강의실 //97th

        list.add("Y21112"); // 하나은행 //학생복지관 //98th

        list.add("Y1115"); // 진료실  //학생회관 - 1층
        list.add("Y1117"); // 진료대기실
        list.add("Y1121"); // 우체국
        list.add("Y1127"); // 학생식당
        list.add("Y1225"); // 학생회관 회의실 //103th

        list.add("Y1126"); // 커피전문점 //104th

        list.add("Y9119"); // 멀티미디어실1  //함박관 - 1층
        list.add("Y9129"); // 멀티미디어실2
        list.add("Y9238"); // 영어회화전용강의실(교양)
        list.add("Y9319"); // 방목기초교육대학교학팀 //함박관 - 3층
        list.add("Y9315"); // 공대회의실(공대학장보실)
        list.add("Y9423"); // 영어회화교수실 //110th
    }


    double[] latitude = {37.22475, 37.22146, 37.22246007484329, 37.22146, 37.22216, 37.22214, 37.22118, 37.22039, 37.21920, 37.21891,
            37.22138, 37.22379, 37.22202, 37.22397, 37.22337, 37.22396, 37.22305, 37.22210, 37.21904, 37.22113, 37.22393, 37.22511,
            37.22381, 37.22335, 37.22238, 37.21943, 37.22233, 37.22165};
    double[] longitude = {127.18768, 127.18684, 127.18715734722015, 127.18684, 127.18850, 127.19080, 127.18851, 127.18534, 127.18296, 127.18375,
            127.18926, 127.18687, 127.18758, 127.18752, 127.18716, 127.18183, 127.18688, 127.18851, 127.18250, 127.18862, 127.18186, 127.18717,
            127.18166, 127.18747, 127.18851, 127.18260, 127.18673, 127.18776};
    String[] title = {"자연캠퍼스", "제2공학관", "제1공학관", "창조예술관", "명진당", "예체능관", "함박관", "디자인조형센터", "제3공학관", "제4공학관",
            "차세대과학관", "채플관", "제5공학관", "통학버스 승강장", "학생회관", "명덕관", "학생복지관(은행)", "명진당 지하(GS25)", "3공학관(CU)", "함박관(세븐일레븐)", "명덕관(GS25)",
            "할리스커피", "명덕관 1층", "학생회관 카페", "명진당 4층", "3공학관 지하", "1공학관 1층", "5공학관 1층"};
    String[] memo = {"정문입니다", "건물번호: Y8", "건물번호: Y", "건물번호: Y2", "건물번호: Y3", "건물번호: Y6", "건물번호: Y9", "건물번호: Y12", "건물번호: Y19", "건물번호: Y13",
            "건물번호: Y23", "건물번호: Y22", "건물번호: Y5", "통학버스 승강장입니다.", "건물번호: Y1", "건물번호: Y31", "은행", "GS25", "CU", "세븐일레븐" ,"GS25", "HOLLYS", "명덕카페",
            "카페", "복사실", "복사실", "복사실", "복사실"};
}
